#include <stdio.h>

int main() {
    // w06-02-01
    int i = 1, j = 2, k;// ระบุค่าตัวแปร i, j, k
    printf("i = %d, j = %d, k = %d\n", i, j, k);// แสดงค่า
    k = i + j;// ให้ k = 1 + 2 ได้ค่า 3
    printf("i = %d, j = %d, k = %d\n", i, j, k);// แสดงค่า
    i = i + (k * j);// ให้ i = 1 + (3 * 2) = 1 + 6 ได้ค่า 7
    printf("i = %d, j = %d, k = %d\n", i, j, k);// แสดงค่า
    j = i / 2;// ให้ j = 7 / 2 ได้ค่า 3
    printf("i = %d, j = %d, k = %d\n", i, j, k);// แสดงค่า
    k = i % 2;// ให้ k = 7 % 2 ได้ค่า 1
    printf("i = %d, j = %d, k = %d\n", i, j, k);// แสดงค่า
    i = (j + k) * 3;// ให้ i = (3 + 1) * 3 ได้ค่า 12
    printf("i = %d, j = %d, k = %d\n", i, j, k);// แสดงค่า

    printf("--------------------------\n");

    // w06-02-02
    double x = 1.0, y = 2.0, z;// ระบุค่าตัวแปร x, y, z
    printf("x = %.1f, y = %.1f, z = %.1f\n", x, y, z);// แสดงค่า
    x = y + 5.0;// ให้ x = 2.0 + 5.0 ได้ค่า 7.0
    printf("x = %.1f, y = %.1f, z = %.1f\n", x, y, z);// แสดงค่า 
    y = x / 2.0;// ให้ y = 7.0 / 2.0 ได้ค่า 3.5   
    printf("x = %.1f, y = %.1f, z = %.1f\n", x, y, z);// แสดงค่า
    y = (x * 3.0) + 4.0;// ให้ y = (7.0 * 3.0) + 4.0 = 21.0 + 4.0 ได้ค่า 25.0
    printf("x = %.1f, y = %.1f, z = %.1f\n", x, y, z);// แสดงค่า
    x = -0.5 - y;// ให้ x = -0.5 - 25.0 ได้ค่า -25.5
    printf("x = %.1f, y = %.1f, z = %.1f\n", x, y, z);// แสดงค่า
    z = x + y;// ให้ z = -25.5 + 25.0 ได้ค่า -0.5     
    printf("x = %.1f, y = %.1f, z = %.1f\n", x, y, z);// แสดงค่า

    return 0;
}
