#include <stdio.h>

int main() {
    int A, B, C, D, E, F, G; // ระบุค่าตัวแปร

    A = -2 + 5 * 2;                
    // กำหนดการคำนวณโดยที่จะคิดจากการคูณก่อนเเล้วค่อยบวก
    B = 10 / 2 * 3;                
    // กำหนดการคำนวณโดยที่จะคิดจากการหารก่อนเเล้วค่อยคูณ
    C = 6 / 2 + 3 * (4 % 2);       
    // กำหนดการคำนวณโดยที่จะคิดจากในวงเล็บก่อนจากนั้นหารคูณเเล้วจบด้วยการบวก
    D = (5 + 2) * 15 % 4;          
    // กำหนดการคำนวณโดยที่จะคิดจากในวงเล็บก่อนจากนั้นคูณเเล้วจบด้วย modulo
    E = 6 + 2 * 2 - 6 / 2;         
    // กำหนดการคำนวณโดยที่จะคิดจากการคูณหาร เเลว้ค่อยบวกเเละลบ
    F = 5 + 3 * 2 - 8 / 4 + (6 % 5); 
    // กำหนดการคำนวณโดยที่จะคิดจากในวงเล็บคูณเเล้วหารจากนั้นค่อยบวกเเละลบ
    G = (4 + 3) * 2 - 10 / (2 + 3); 
    // กำหนดการคำนวณโดยที่จะคิดจากในวงเล็บก่อนคูณหารเเละจบด้วยลบ

    printf("A = %d\n", A);  // แสดงค่า
    printf("B = %d\n", B);  // แสดงค่า
    printf("C = %d\n", C);  // แสดงค่า
    printf("D = %d\n", D);  // แสดงค่า
    printf("E = %d\n", E);  // แสดงค่า
    printf("F = %d\n", F);  // แสดงค่า
    printf("G = %d\n", G);  // แสดงค่า

    return 0;
}
