#include <stdio.h>

int main() {
    int a = 5, b = 2;
    float x = 3.0, y = 4.5;

    int r1 = a++ * b + (int)y % 3;
    // ให้ a++ = 5 (ใช้ก่อนเพิ่ม), b = 2, (int)y = 4 ได้ 5*2 + 4%3 = 10 + 1 = 11
    // จากนั้น a = 6

    int r2 = (a > b) && ((int)x / b < 2);
    // ได้ 6 > 2 && 3 / 2 < 2 ได้ 1 && 1 < 2 ได้ ได้ 1 && 1 = 1

    float r3 = ++x * y - a / 2;
    // ++x ทำให้ x = 4.0 ได้ 4.0 * 4.5 - 6 / 2 ได้ 18.0 - 3 = 15.0

    float r4 = ((x += 1.5) > y) || (b-- > 0);
    // x = 4.0 + 1.5 = 5.5 ได้ 5.5 > 4.5 เท่ากับ 1 เเละ 2 > 0 ทำให้ได้ 1 || 1 ผลเป็น 1.0
    // จากนั้น b = 1

    // แสดงผล
    printf("r1 = %d\n", r1);    // ได้ผลลัพธ์ คือ 11
    printf("r2 = %d\n", r2);    // ได้ผลลัพธ์ คือ 1
    printf("r3 = %.2f\n", r3);  // ได้ผลลัพธ์ คือ 15.00
    printf("r4 = %.2f\n", r4);  // ได้ผลลัพธ์ คือ 1.00

    return 0;
}
