#include <stdio.h>

int main() {
    int a = 5, b = 17; // กำหนดค่าตัวแปร a, b เป็น int
    float c = 8.5, d = 4.0; // กำหนดค่าตัวแปร c, d เป็น float

    printf("a = %d, b = %d, c = %.1f, d = %.1f\n", a, b, c, d);    
    // แสดงค่าตัวแปรทั้งหมด

    printf("%.1f\n", d + a);    
    // แสดงผลลัพธ์ได้ค่าเป็นทศนิยม float 
    // เนื่องจาก d เป็นค่า float ผลลัพธ์จึงเป็น float

    printf("%d\n", a - b); // แสดงผลลัพธ์ได้ค่า int

    printf("%.1f\n", c * d); // แสดงผลลัพธ์ได้ค่าเป็นทศนิยม float

    printf("%.1f\n", a * c);  // แสดงผลลัพธ์ได้ค่าเป็นทศนิยม float

    printf("%.1f\n", c / d);  // แสดงผลลัพธ์ได้ค่าเป็นทศนิยม float

    printf("%.1f\n", b / c);  // แสดงผลลัพธ์ได้ค่าเป็นทศนิยม float

    printf("%d\n", a % b);  // แสดงผลลัพธ์ได้ค่า int

    // ข้อ 9. c % a ทำไม่ได้เนื่องจากผลลัพธ์จะ error 
    // เพราะใช้ % กับ float ไม่ได้ เพราะ % ที่จะหาค่าเศษต้องใช้กับ int เท่านั้น

    // ข้อ 10. c % d ทำไม่ได้เนื่องจากผลลัพธ์จะ error 
    // เพราะใช้ % กับ float ไม่ได้ เพราะ % ที่จะหาค่าเศษต้องใช้กับ int เท่านั้น

    return 0;
}
